🚀&nbsp; env0 had composed a PR Plan for environment [My First Project / Env0 ](https://app.env0.com/p/66126e98-0570-44a1-a749-457e1220afa6/environments/e54c8a6b-05bd-4d79-aa1a-d63c7e467d37):
```
Plan: 4 to add, 0 to change, 4 to destroy.
```
<details>
<summary>Plan Details</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:


  # random_string.random must be replaced
-/+ resource "random_string" "random" {
!       id          = "pbjpy" -> (known after apply)
!       length      = 5 -> 6 # forces replacement
!       result      = "pbjpy" -> (known after apply)
        # (9 unchanged attributes hidden)
    }


  # module.s3.aws_s3_bucket.this[0] must be replaced
-/+ resource "aws_s3_bucket" "this" {
+       acceleration_status         = (known after apply)
!       arn                         = "arn:aws:s3:::env0-acme-bucket-pbjpy" -> (known after apply)
!       bucket                      = "env0-acme-bucket-pbjpy" -> (known after apply) # forces replacement
!       bucket_domain_name          = "env0-acme-bucket-pbjpy.s3.amazonaws.com" -> (known after apply)
!       bucket_regional_domain_name = "env0-acme-bucket-pbjpy.s3.us-west-2.amazonaws.com" -> (known after apply)
!       hosted_zone_id              = "Z3BJ6K6RIION7M" -> (known after apply)
!       id                          = "env0-acme-bucket-pbjpy" -> (known after apply)
!       object_lock_enabled         = false -> (known after apply)
!       region                      = "us-west-2" -> (known after apply)
!       request_payer               = "BucketOwner" -> (known after apply)
-       tags                        = {} -> null
!       tags_all                    = {} -> (known after apply)
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)
        # (2 unchanged attributes hidden)

+       object_lock_configuration {
+           object_lock_enabled = (known after apply)

+           rule {
+               default_retention {
+                   days  = (known after apply)
+                   mode  = (known after apply)
+                   years = (known after apply)
                }
            }
        }

-       server_side_encryption_configuration {
-           rule {
-               bucket_key_enabled = false -> null

-               apply_server_side_encryption_by_default {
-                   sse_algorithm = "AES256" -> null
                }
            }
        }

!       versioning {
!           enabled    = false -> (known after apply)
!           mfa_delete = false -> (known after apply)
        }
    }


  # module.s3.aws_s3_bucket_acl.this[0] must be replaced
-/+ resource "aws_s3_bucket_acl" "this" {
!       bucket = "env0-acme-bucket-pbjpy" -> (known after apply) # forces replacement
!       id     = "env0-acme-bucket-pbjpy,private" -> (known after apply)
        # (1 unchanged attribute hidden)

!       access_control_policy {
-           grant {
-               permission = "FULL_CONTROL" -> null

-               grantee {
-                   display_name = "mazishmaya" -> null
-                   id           = "0480c9f9e3e9d06439783d3f2521abf255e51c5445cbb9d7ad04ac4e3a72f805" -> null
-                   type         = "CanonicalUser" -> null
                }
            }
+           grant {
+               permission = (known after apply)

+               grantee {
+                   display_name  = (known after apply)
+                   email_address = (known after apply)
+                   id            = (known after apply)
+                   type          = (known after apply)
+                   uri           = (known after apply)
                }
            }

!           owner {
!               display_name = "mazishmaya" -> (known after apply)
!               id           = "0480c9f9e3e9d06439783d3f2521abf255e51c5445cbb9d7ad04ac4e3a72f805" -> (known after apply)
            }
        }
    }


  # module.s3.aws_s3_bucket_public_access_block.this[0] must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "this" {
!       bucket                  = "env0-acme-bucket-pbjpy" -> (known after apply) # forces replacement
!       id                      = "env0-acme-bucket-pbjpy" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 4 to add, 0 to change, 4 to destroy.

Changes to Outputs:
!   s3_bucket_arn = "arn:aws:s3:::env0-acme-bucket-pbjpy" -> (known after apply)
╷
│ Warning: Attribute Deprecated
│ 
│   with random_string.random,
│   on main.tf line 24, in resource "random_string" "random":
│   24:   number  = true
│ 
│ **NOTE**: This is deprecated, use `numeric` instead.
│ 
│ (and one more similar warning elsewhere)
╵
```
</details>


```
There are no cost estimation changes
```

[Full PR Plan logs on env0](https://app.env0.com/p/66126e98-0570-44a1-a749-457e1220afa6/environments/e54c8a6b-05bd-4d79-aa1a-d63c7e467d37/deployments/fcf2103f-6b38-491b-92da-bffc2f5cc2fe)